<?

$CONST_STR = array(

//****************************** error ****************************
	"error" => "hehe",

//****************************** game ****************************
	"who_type"  => 1,
	"kill_type" => 2,
	"wolf_type" => 3,

//****************************** const string ********************
	"welcome" => "欢迎关注一起玩游戏，回复“开”开创房间，或者直接回复房间号开始游戏。[建议按座位顺序一个一个加入！！！]",

//++++++++++++++++++++++ for NEW ++++++++++++++++++++
	"help_info" => "回复“开”开创房间，或者直接回复房间号开始游戏",

//++++++++++++++++++++++ for 法官 ++++++++++++++++++++
	"chose_game" => "回复“1”玩谁是卧底，回复“2”玩杀人游戏，回复“3”玩狼人游戏，回复“真”随机选择真心话，回复“冒”随机选择大冒险",

//---------- who ----------    
	"who_begin" => "你选择玩“谁是卧底”，请输入游戏人数，算上自己哦，你是法官大人",

	"set_word1" => "请输入平民词:",
	"set_word2" => "请输入卧底词:",

	"who_res_1" => "房间号为 ",
	"who_res_2" => "，卧底是 ",
	"who_res_3" => "。输入“投”开放投票（如果人少可以不使用该功能），输入“换”更换词语，输入“关”关闭房间。",

	"who_post" => "输入“查”查看投票结果",
	"who_post_res" => "被投死的是 ",

//---------- kill ----------  
	"kill_begin" => "你选择玩“杀人游戏”，请输入依次输入 杀手 警察 平民 医生 （一共4个数字哦）的个数，用空格隔开。",

	"kill_res_0" => "房间号为 ",
	"kill_res_1" => "，杀手是 ",
	"kill_res_2" => "，警察是 ",
	"kill_res_3" => "，平民是 ",
	"kill_res_4" => "，医生是 ",
	"kill_res_5" => "。输入今夜死掉人的编号开始投票流程（一个一个输入，建议人草鸡多以至于智商不足以计票或者觉得跟票神马的神烦时使用），输入“投”开放投票，输入“换”进行下一轮，输入“关”关闭房间。",
	
	"kill_kill" => "输入“投”开放投票",
	"kill_post" => "输入“查”查看投票结果",
	"kill_p_res" => "被投死的是 ",

//---------- wolf ----------  
	"wolf_begin" => "你选择玩“狼人游戏”，请输入依次输入 狼人 平民 女巫 预言家 丘比特 医生 守卫 长老 猎人 小女孩 白痴 吹笛者（一共12个数字哦）的个数,用空格隔开",

	"wolf_res" => array(	
					"房间号为 ",
					"，狼人是 ",
					"，平民是 ",
					"，女巫是 ",
					"，预言家是 ",
					"，丘比特是 ",
					"，医生是 ",
					"，守卫是 ",
					"，长老是 ",
					"，猎人是 ",
					"，小女孩是 ",
					"，白痴是 ",
					"，吹笛者是 ",
					"。输入丘比特连接对象（用空格隔开的两个数字）。"
					),
	"wolf_qiu" => "输入今夜死掉人的编号开始投票流程（一个一个输入，建议人草鸡多以至于智商不足以计票或者觉得跟票神马的神烦时使用），输入“投”开放投票，输入“换”进行下一轮，输入“关”关闭房间。",
	"wolf_kill" => "输入“投”开放投票",
	"wolf_post" => "输入“查”查看投票结果",    
	"wolf_p_res_1" => array(
					"被投死的是 ",
					"，身份是 ",
					"。"
					),
	"wolf_p_res_2" => array(
					"目前战况如下：狼人活 ",
					"，平民活 ",
					"，女巫活 ",
					"，预言家活 ",
					"，丘比特活 ",
					"，医生活 ",
					"，守卫活 ",
					"，长老活 ",
					"，猎人活 ",
					"，小女孩活 ",
					"，白痴活 ",
					"，吹笛者活 ",
					),

//++++++++++++++++++++++ for player ++++++++++++++++++++
	"goto_help" => "法官如果说开始投票，那么请在法官查询结果前输入想投人的数字，过时不候。输入“领”领取词语，输入“退”退出房间。",
	"goto_error" => "进入房间出问题啦，可能是房间号输入错误，或者人满啦。",

	"goto" => array(
					"欢迎加入房间号",
					"，你的编号是",
					"，法官如果说开始投票，那么请在法官查询结果前输入想投人的数字，过时不候。输入“领”领取词语，输入“退”退出房间。"
					),

);

//****************************** state ****************************
$STATE = array(
	"ST_NEW" => 1,

//
	"ST_WHO_FA_1" => 21, 	// wait to enter how many players
	"ST_WHO_FA_2" => 22,	// wait to enter word1
	"ST_WHO_FA_3" => 23,  	// wait to enter word2
	"ST_WHO_FA" => 2, 		// all finshed
	"ST_WHO_POST" => 24,

	"ST_KILL_FA_1" => 31, 	// wait to enter how many players
	"ST_KILL_FA" => 3,		// all finished
	"ST_KILL_POST"=> 32,

	"ST_WOLF_FA_1" => 41, 		// wait to enter how many players
	"ST_WOLF_FA_2" => 42, 		// wait to enter cp
	"ST_WOLF_FA" => 4,
	"ST_WOLF_POST" => 43,

//
	"ST_WHO_PLAYER" => 5,
	"ST_KILL_PLAYER" => 6,
	"ST_WOLF_PLAYER" => 7,

);
?>